Autodesk.Revit.DB.ScheduleSortGroupField.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ScheduleSortGroupField.ShowFooterCount
Indicates if the footer row should display a count of elements in the group.
Remarks:
ShowFooterCount can only be enabled if ShowFooter is enabled.
True if an element count should be displayed, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Display of footer rows is not enabled.
Since:
2013

Autodesk.Revit.DB.ScheduleSortGroupField.ShowFooterTitle
Indicates if the footer row should display a title.
Remarks:
The title consists of the value of the field that the
schedule is grouped by.
ShowFooterTitle can only be enabled if ShowFooter is enabled.
True if a title should be displayed, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Display of footer rows is not enabled.
Since:
2013

Autodesk.Revit.DB.ScheduleSortGroupField.ShowFooter
Indicates if a footer row should be displayed after each group.
Remarks:
The footer row displays totals of each field for which
totals are enabled.  It can also optionally display a title
(see ShowFooterTitle) and a count of elements
(see ShowFooterCount).
True if a footer row should be displayed, false otherwise.
Since:
2013

Autodesk.Revit.DB.ScheduleSortGroupField.ShowBlankLine
Indicates if an empty row should be displayed between groups.
Remarks:
True if an empty row should be displayed, false otherwise.
Since:
2013

Autodesk.Revit.DB.ScheduleSortGroupField.ShowHeader
Indicates if a header row should be displayed before each group.
Remarks:
The header row displays a title consisting of the value of
the field that the schedule is grouped by.
True if a header row should be displayed, false otherwise.
Since:
2013

Autodesk.Revit.DB.ScheduleSortGroupField.SortOrder
Indicates if elements in the schedule will be sorted in
ascending or descending order.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleSortGroupField.FieldId
The ID of the field that the schedule will be sorted or grouped by.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleSortGroupField.#ctor(Autodesk.Revit.DB.ScheduleFieldId,Autodesk.Revit.DB.ScheduleSortOrder)
Creates a new ScheduleSortGroupField.
fieldId:
The ID of the field that the schedule will be sorted or grouped by.
sortOrder:
The sort order, ascending or descending.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleSortGroupField.#ctor(Autodesk.Revit.DB.ScheduleFieldId)
Creates a new ScheduleSortGroupField.
fieldId:
The ID of the field that the schedule will be sorted or grouped by.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleSortGroupField.#ctor
Creates a new ScheduleSortGroupField.
Since:
2013

Autodesk.Revit.DB.ScheduleSortGroupField
A field that is used for sorting and/or grouping in a schedule.
Remarks:
A schedule may be sorted or grouped by one or more of the
schedule's fields.  The ScheduleSortGroupField class represents
one of the fields that the schedule is sorted or grouped by.
Sorting and grouping are related operations.  In either case,
elements appearing in the schedule are sorted based on their values
for the field that the schedule is sorted/grouped by, which automatically
causes elements with identical values to be grouped together.
By enabling extra header, footer, or blank rows, visual separation
between groups can be achieved.
If ScheduleDefinition.IsItemized is false, elements having the
same values for all of the fields used for sorting/grouping will be
combined onto the same row.
A schedule can be sorted or grouped by data that is not displayed
in the schedule by marking the field used for sorting/grouping as hidden
using the ScheduleField.IsHidden property.
Since:
2013